using System;
using System.Collections.Generic;
using System.Text;

namespace _2DActionGame
{
	/// <summary>
	/// 日本語表示のテキストを格納するクラス
	/// </summary>
    static class MessageTable
    {
		public static string[] debugMenuMsgs = {
			"戻る",
			"デバッグモードをon/offにします",
			"ミュートのon/off",
			"ゲーム中、剣の判定矩形を表示します",
			//"ゲーム中、画面上にスコアを表示します",
			"Tで打ち上げと同時にジャンプ、Fで打ち上げ後押しっぱなしで追撃",
			"Trueでチャージ制、Falseでコマンド制になります",
			"Trueで2ボタンモード、Falseで1ボタンモード",
			//"空の項目",
		};

        public static string[] optionMsgs = {
            "フルスクリーンモードのOn/Off",
            "BGMの音量の調整",
            "ミュートのOn/Off",
            "サウンドテストへ",
            "ランキングを確認する",
            "ステージ選択してゲームを始める",
             "スタッフロールを見る",
             "攻撃のモードを切り替える",
            "メニューに戻る"
        };


        public static string[] Messages = {
            "日本語メッセージテスト\n"+
            "キーボードのEnterキー、コントローラーのＡボタンで\n"+
            "次のメッセージを表示します。",

            "このサンプルではXNA2.0から導入された\n"+
            "プロセッサ・パラメーターを使っています。\n" +
            "MessageProcessorのMessageFilenameパラメーターに\n"+
            "好きなテキストファイル名を指定すると、\n"+
            "そのファイル内の文字をSpriteFontに変換します。",

            "ここではソースファイルであるMessageTable.csを\n"+
            "使っているので、前のサンプルよりシンプルに\n" +
            "多言語文字を表示することができます。",

            "前回のサンプルはRPGなどの大量のテキストを扱う時に\n" +
            "テキストデータ部分を圧縮したりするのに適していますが\n" +
            "「Ａボタンを押してください」といった\n"+
            "シンプルなメッセージを書くには\n"+
            "こういった簡単な手法でも良いでしょう。",

            "MessageTable.csを変更すると自動的に\n"+
            "コンテントビルドされるので、\n" +
            "頻繁に書き換えるプログラムファイルを指定するのは\n" +
            "避けたほうが良いでしょう、",

            "また、このサンプルでは指定されたファイルを\n"+
            "UTF-8として読み込むのでMessageTable.csの\n" +
            "エンコーディングはシフトJISではなく\n"+
            "UTF-8になっています。",

            "最初のメッセージに戻ります。",
        };
    }
}
